{"pageProps":{"content":"# How to contribute to DeepSynthBody\n\n\nDeepSynthBody is an open source project, so all contributions, feedbacks and suggestions are welcome.  You can contribute through pull requests on the [Github repository](https://github.com/simulamet-host/deepsynthbody) or through the [feedback form](https://deepsynthbody.org/form/) on the website.\n\n## 1.How to contribute via pull request(PR)?\n\n* First, fork the repository to your own GitHub account. This will create a copy of the repository that you can modify and submit changes to.\n\n* Clone the repository to your local machine. This will allow you to make changes to the repository and push them back to your fork.\n\n* Add you contributions and describe the contribution you'd like to make before submitting any code.\n\n* Commit your changes and push them to your fork.\n\n* On the original repository, create a new pull request to merge your changes (i.e. the added dataset) into the main branch.\n\n* Provide a brief description of your changes and the dataset you are adding.\n\n* Wait for the maintainers of the repository to review your pull request. They may ask for additional information or make suggestions for changes before merging it into the main branch.\n\n## 2.How to add a dateset?\n\nThe [MDFiles](https://github.com/simulamet-host/deepsynthbody/tree/main/MdFiles) folder can be used to add datasets by adding markdown files. Markdown files should have front-matter in order to add more complex data.  Front-matter has to be on the top of the file and begins and ends with three dashes ---. \n\n<img src=\"/docsImages/frontmatter2.png\" width=\"800\" />\n<img src=\"/docsImages/frontmatter.png\" width=\"800\" />\n\n* *title*: To insert the title of the dataset.\n* *category*: Specify a category that the dataset belogs to.\n* *subcategory* : An optional front matter variable, that can use if the category has subcategory.\n* *subsubcategory* : An optional front matter variable for categories with subcategories of subcategories.\n* *desc* : In this variable, you can provide a short description of the dataset.\n* *thumbnail*:  To insert a image link or image file path.\n* *publication*: To insert a publication link.\n* *show*: Takes a boolean value. Set to false if you don’t want a specific post to show up when the site is generated.\n\n**Images** related to models can be uploaded to the image folders belogning to the categories under the public file.(i.e `public/cardioImages/` ) \n\n## 3.How to add categories and subcategories?\n\nTo add a category, it is sufficient to add the new category name to the front matter variable of the md document inside the MdFiles folder where you add the model. It is valid for subcategories and subcategory of subcategories as well.\n\n<img src=\"/docsImages/categoryFrontmatter.png\" width=\"800\" />\n\n**Images** related to categories can be written to the md file under the CategoryImages `CategoryImages/categoryImages.md` and category images can be uploaded to the `public/imagesOfCategories`.\n\n#### Subcategories of the model categories\n\n* Seperate headings for subcategories can be written in the front matter of the file `HeadingOrDesc/subcategory/subCategoryHeadings.md`. \n<img src=\"/docsImages/headingsordesc.png\" width=\"800\" />\n\n* Seperate descriptions for each subcategories can be written in the front matter of the file `HeadingOrDesc/subcategory/subCategoryDesc.md`. \n* A description of the search bar can be placed at the top of the page for each subcategory by writing in the front matter of the file `HeadingOrDesc/subcategory/search.md.`.\n* Model description for each subcategory can be written in the front matter of the file `HeadingOrDesc/subcategory/modelDesc.md`. \n* Model headings for each subcategory can be written in the front matter of the file `HeadingOrDesc/subcategory/modelsHeadings.md`. \n\nThe same file structure is valid for 2nd level subcategories and 3rd level subcategories.\n* `HeadingOrDesc/subsubcategory/`\n* `HeadingOrDesc/thirdLevelOfCategories/`\n\n## 3.How to change data on slider, footer and home page?\n\n**Slider** is a element that displays a series of images, button, description on the top of the home page. You can add slider content with a md file within the `sliderFiles` directory.\n<img src=\"/docsImages/slider.png\" width=\"800\" />\n\n* *buttonName*: To insert a link that goes to the link when the button is clicked.\n* *thumbnail*: To insert a image link or image file path.\n* *link*: To insert an external link.\n* *description*: To provide a description.\n* *show*: Takes a boolean value. Set to false if you don’t want a specific post to show up when the site is generated.\n\n**Footer** is the element that displays on the bottom of the home page. Footer content can be changed from  `HeadingOrDesc/home.md` file, `footer` variable of the front matter.\n<img src=\"/docsImages/homemd.png\" width=\"800\" />\n\n**Search Heading** is the title on top of the search bar. Home pages search heading can be chagned from `HeadingOrDesc/home.md` file, `SearchHeading` variable of the front matter.\n\n## 4.How to add content to the about, docs, and news page?\n\n* **About page** content is in the `about/about.md` file.\n* **Docs page** content is in the `docsMd/docs.md` file.\n\n* **How to add news to the news page?**    \nTo add a news, please add a new md file under the `newsMd` folder. And insert the front matter variables below.\n\n<img src=\"/docsImages/newsmd.png\" width=\"800\" />\n\n* *title*: To insert the title of the news.\n* *image*: To insert a image link or image file path.\n* *link*: The external link of the news.\n* *description* : To provide a shortdescription of the news.\n* *category*: Specify a category that the news belogs to.\n* *date*: Date of the news.\n* *tag1*: To insert tag.\n* *tag2*: To insert second tag.\n* *author*: Author of the news.\n* *show*: Takes a boolean value. Set to false if you don’t want a specific news to show up when the site is generated."},"__N_SSG":true}