{"pageProps":{"content":"\n# Welcome to DeepSynthBody\n\n<img align=\"left\" src=\"/heroimage.png\" width=\"420\" style=\"padding-right:35px\" />\n\nA novel framework to solve data deficiency problems caused by privacy issues and time-consuming and costly medical data annotation processes.\n>[[To pip Package]](https://pypi.org/project/deepsynthbody/)\n\n## Main objectives of Deepsynthbody are:\n* Overcome the privacy related limitations for medical data by producing open access deep synthetic data.\n* Reduce the time-consuming and resource-consuming process of medical data labeling and annotation.\n* Find inter-correlations of human body organs (how one organ affect to other organs) and functions and reproduce them to produce a new model for the human body.\n\n## Additionaly, Deepsynthbody works as:\n* A repository for deep generative models used in medicine.\n* A data compression mechanism to keep big medical data sets in a small storage without any privacy concerns and space to save large amounts of the data\n\n## Architecture of DeepSynthBody framework\n<img src=\"/architecture.png\" width=\"900\" />\n\n## Generative models are organized under 11 categories which may contain subcategories and subsub categories.\n1. Cardiovascular\n   - ECG model.\n2. Digestive \n   - GI tract\n3. Endocrine\n4. Integumentary\n5. Lymphatic\n6. Muscular\n7. Nervous\n8. Urinary\n9. Reproductive\n10. Respiratory\n11. Skeletal\n\n\n## How to contribute to Deepsynthbody as a researcher?\n<img src=\"/contribute.png\" width=\"800\" />\n\n## Citation:\n```bash\n@inproceedings{deepsynthbody,\n  title={DeepSynthBody: the beginning of the end for datadeficiency in medicine},\n  author={Thambawita, Vajira and Hicks, Steven A. and Isaksen, Jonas and Stensen, Mette Haug and Haugen, Trine B. and Kanters, Jørgen and Parasa, Sravanthi and Lange, Thomas de and Johansen, Håvard D. and Johanse, Dag and Hammer, Hugo L. and Halvorsen, P{\\aa}l and Riegler, Michael A.},\n  booktitle={In Proceedings of the International Conference on Applied Artificial Intelligence (ICAPAI 2021)},\n  year={2021}\n}\n```\n\n## Contact us\n[deepsynthbody@gmail.com](deepsynthbody@gmail.com)<br />\n[vajira@simula.no](vajira@simula.no)<br />\n[michael@simula.no](michael@simula.no)<br />\n\n"},"__N_SSG":true}